In [3]:
!pip install pandas
!pip install sqlalchemy
!pip install pymysql

Requirement already satisfied: pandas in c:\users\lin\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\lin\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.18.5 in c:\users\lin\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\lin\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\lin\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Requirement already satisfied: sqlalchemy in c:\users\lin\anaconda3\lib\site-packages (1.4.32)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\lin\anaconda3\lib\site-packages (from sqlalchemy) (1.1.1)
Requirement already satisfied: pymysql in c:\users\lin\anaconda3\lib\site-packages (1.0.2)

In [4]:
import pandas as pd
import sqlalchemy as alch
from getpass import getpass

In [5]:
contraseña = getpass("introduce tu contraseña")

introduce tu contraseña········

In [8]:
bbdd = "seguros"
conexion = f"mysql+pymysql://root:{contraseña}@localhost/{bbdd}"

In [9]:
engine = alch.create_engine(conexion)

In [10]:
pd.read_sql("select * from clientes", engine)

,idcliente,genero,raza,experiencia,educacion,estado_civil,hijos,clase,codigo_postal
0,101,female,majority,10-19y,university,1.0,1.0,upper class,92101
1,125,male,majority,20-29y,university,0.0,0.0,upper class,10238
2,166,male,majority,0-9y,university,0.0,0.0,upper class,10238
3,186,male,majority,0-9y,high school,1.0,1.0,working class,32765
4,217,male,majority,0-9y,none,0.0,0.0,poverty,10238
...,...,...,...,...,...,...,...,...,...
9995,999634,male,majority,20-29y,high school,0.0,0.0,middle class,10238
9996,999797,male,majority,20-29y,university,1.0,1.0,upper class,32765
9997,999856,male,majority,10-19y,high school,1.0,1.0,upper class,10238
9998,999962,male,majority,0-9y,university,1.0,1.0,upper class,32765
9999,999976,female,majority,10-19y,high school,1.0,1.0,middle class,10238

In [11]:
pdcliente = pd.read_csv("../apuntes/apuntes-clases/semana-7/7.1-SQL-Alquemy/data/datos_clientes.csv")
pdseguro = pd.read_csv("../apuntes/apuntes-clases/semana-7/7.1-SQL-Alquemy/data/datos_seguro.csv")
pdvehiculo = pd.read_csv("../apuntes/apuntes-clases/semana-7/7.1-SQL-Alquemy/data/datos_vehiculos.csv")

In [12]:
pdseguro.isnull().sum()

Unnamed: 0          0
ID                  0
DUIS                0
PAST_ACCIDENTS      0
CREDIT_SCORE      982
ID_SEGURO           0
dtype: int64

In [13]:
pdseguro.fillna(pdseguro["CREDIT_SCORE"].mean(),inplace = True)

In [14]:
pdvehiculo.head()

   Unnamed: 0  VEHICLE_OWNERSHIP VEHICLE_YEAR ID_VEHICULO      ID
0           0                1.0   after 2015  BZ1WE0LF2U  569520
1           1                0.0  before 2015  78GJYCA4LI  750365
2           2                1.0  before 2015  TG2JSADVLY  199901
3           3                1.0  before 2015  DB1O2IYHP4  478866
4           4                1.0  before 2015  RIZYYIZNVG  731664

In [25]:
for index, row in pdcliente.iterrows():
    cliente_id = engine.execute(f"""SELECT idcliente FROM clientes WHERE idcliente = '{row["ID"]}';""")
    
    if len(list(cliente_id)) > 0:
        pass
    else:
        querycliente = f"""INSERT INTO clientes (idcliente, genero, raza, experiencia, educacion, estado_civil, hijos, clase, codigo_postal)
                VALUES
                ('{row["ID"]}', '{row["GENDER"]}', '{row["RACE"]}', '{row["DRIVING_EXPERIENCE"]}', '{row["EDUCATION"]}', '{row["MARRIED"]}', '{row["CHILDREN"]}', '{row["INCOME"]}', '{row["POSTAL_CODE"]}')
                """
        engine.execute(querycliente)

In [42]:
for index, row in pdseguro.iterrows():
    seguro_id = engine.execute(f"""SELECT idseguro FROM seguro WHERE idseguro = '{row["ID_SEGURO"]}';""")
    
    if len(list(seguro_id)) > 0:
        pass
    else:
        queryseguro = f"""INSERT INTO seguro (idseguro, duis, accidentes, score, clientes_idcliente)
                VALUES
                ('{row["ID_SEGURO"]}', '{row["DUIS"]}', '{row["PAST_ACCIDENTS"]}', '{row["CREDIT_SCORE"]}', '{row["ID"]}')
                """
        engine.execute(queryseguro)

In [49]:
for index, row in pdvehiculo.iterrows():
    vehiculo_id = engine.execute(f"""SELECT idvehiculos FROM vehiculos WHERE idvehiculos = '{row["ID_VEHICULO"]}';""")
    
    if len(list(seguro_id)) > 0:
        pass
    else:
        queryvehiculo = f"""INSERT INTO vehiculos (idvehiculos, propietarios, año, clientes_idcliente)
                VALUES
                ('{row["ID_VEHICULO"]}', '{row["VEHICLE_OWNERSHIP"]}', '{row["VEHICLE_YEAR"]}', '{row["ID"]}')
                """
        engine.execute(queryvehiculo)

In [15]:

querycase = f"""SELECT 
                (CASE
                    WHEN score < 0.3 THEN "Cliente de riesgo"
                    WHEN score > 0.3 AND score < 0.8 THEN "Regulinchi"
                    ELSE "Cliente suuuper"
                    END) AS tipo_riesgo, idvehiculos, genero, educacion
                FROM seguro
                inner join clientes on seguro.clientes_idcliente = clientes.idcliente
                inner join vehiculos on clientes.idcliente = vehiculos.clientes_idcliente
                """

In [16]:
df_case = pd.read_sql(querycase, engine)
df_case

     tipo_riesgo idvehiculos  genero    educacion
0     Regulinchi  UIZBKLN6XQ  female   university
1     Regulinchi  BGDS3106O9    male   university
2     Regulinchi  XTDL2RI1NW    male   university
3     Regulinchi  R6VYXPIHNM    male  high school
4     Regulinchi  TZKPY4ZAUR    male         none
...          ...         ...     ...          ...
9989  Regulinchi  E2EB3V13TB    male  high school
9990  Regulinchi  XM3H1N2V6C    male   university
9991  Regulinchi  B56E4G9PNW    male  high school
9992  Regulinchi  K6R0O5FYNY    male   university
9993  Regulinchi  CQX6CYQNJY  female  high school

[9994 rows x 4 columns]

In [ ]:
queryrara = """SELECT score, idcliente, propietarios FROM seguro
               INNER JOIN clientes ON seguro.clientes_idcliente = clientes.idcliente
               INNER JOIN vehiculos ON clientes.idcliente = vehiculos.clientes_idcliente
               WHERE score = (SELECT MAX(score) FROM seguro);
            """

In [ ]:
queryrara2 = """SELECT clientes_idcliente, propietarios from vehiculos
                WHERE clientes_idcliente = (SELECT clientes_idcliente FROM seguro
                                            WHERE score = (SELECT MAX(score) FROM seguro));

             """